id		dt
1001	2021-12-12
1001	2021-12-13
1001	2021-12-14
1001	2021-12-16
1001	2021-12-19
1001	2021-12-20

1002	2021-12-12
1002	2021-12-16
1002	2021-12-17

结果
1001	5
1002	2

思路一：等差数列
1001	2021-12-12	1
1001	2021-12-13	2
1001	2021-12-14	3
1001	2021-12-16	4
1001	2021-12-19	5
1001	2021-12-20	6

1001	2021-12-12	1	2021-12-11
1001	2021-12-13	2	2021-12-11
1001	2021-12-14	3	2021-12-11
1001	2021-12-16	4	2021-12-12
1001	2021-12-19	5	2021-12-14
1001	2021-12-20	6	2021-12-14

1001	2021-12-11	3
1001	2021-12-12	1
1001	2021-12-14	1

1001	2021-12-11	3	1
1001	2021-12-12	1	2
1001	2021-12-14	1	3

1001	2021-12-11	3	1	2021-12-10
1001	2021-12-12	1	2	2021-12-10
1001	2021-12-14	1	3	2021-12-11

思路二：分组
1001	2021-12-12
1001	2021-12-13
1001	2021-12-14
1001	2021-12-16
1001	2021-12-19
1001	2021-12-20

1)将上一行时间数据下移
1001	2021-12-12	1970-01-01
1001	2021-12-13	2021-12-12
1001	2021-12-14	2021-12-13
1001	2021-12-16	2021-12-14
1001	2021-12-19	2021-12-16
1001	2021-12-20	2021-12-19
select
    id,
    dt,
    lag(dt,1,'1970-01-01') over(partition by id order by dt) lagdt
from
    test3;t1

2)将当前行时间减去上一行时间数据(datediff(dt1,dt2))
1001	2021-12-12	564564
1001	2021-12-13	1
1001	2021-12-14	1
1001	2021-12-16	2
1001	2021-12-19	3
1001	2021-12-20	1
select
    id,
    dt,
    datediff(dt,lagdt) flag
from
    t1;t2

3)按照用户分组,同时按照时间排序,计算从第一行到当前行大于2的数据的总条数(sum(if(flag>2,1,0)))
1001	2021-12-12	1
1001	2021-12-13	1
1001	2021-12-14	1
1001	2021-12-16	1
1001	2021-12-19	2
1001	2021-12-20	2
select
    id,
    dt,
    sum(if(flag>2,1,0)) over(partition by id order by dt) flag
from
    t2;t3

4)按照用户和flag分组,求最大时间减去最小时间并加上1
select
    id,
    flag,
    datediff(max(dt),min(dt)) days
from
    t3
group by id,flag;t4

5)取连续登录天数的最大值
select
    id,
    max(days)+1
from
    t4
group by id;

6)最终HQL
select
    id,
    max(days)+1
from
    (select
    id,
    flag,
    datediff(max(dt),min(dt)) days
from
    (select
    id,
    dt,
    sum(if(flag>2,1,0)) over(partition by id order by dt) flag
from
    (select
    id,
    dt,
    datediff(dt,lagdt) flag
from
    (select
    id,
    dt,
    lag(dt,1,'1970-01-01') over(partition by id order by dt) lagdt
from
    test3)t1)t2)t3
group by id,flag)t4
group by id;